# #####################################################
# #                                                   #
# #                代码说明：必看                       #       # #                                                   #
# #                                                   #
# #####################################################
# 本课程提供所有相关的代码片段和实战代码
# 为了便于学习，所有代码分布如下：
# 1. 可以在线运行的教学演示片段，您可以在本站直接运行。
# 2. 不可在线运行的教学演示片段，您可以在百度网盘地址下载。
# 3. 实战案例代码发布在慕课网的git仓库，请自行下载。
#==============================================
# 在线运行地址：https://1goto.ai
# 百度网盘地址：链接: https://pan.baidu.com/s/1H_dzHjYojYlMu1tjtxuEiQ?pwd=cmbx
# 慕课网仓库地址：https://git.imooc.com/coding-925/jiaoxue
#===============================================
# 注意：本地运行与实战代码，需要本地搭建环境，如果您遇到环境搭建困难，可以加入社群，或在慕课网的问答区提问。